# Data Analysis and Filtration

In [2]:
import pandas as pd;

cusine:pd.DataFrame=pd.read_csv(r'./raw/cusine_type.csv')
user_ratings: pd.DataFrame = pd.read_csv(r'./raw/user_ratings.csv')

In [3]:
cusine.head()

   id  placeID        Rcuisine
0   1   135110         Spanish
1   2   135109         Italian
2   3   135107  Latin_American
3   4   135106         Mexican
4   5   135105       Fast_Food

In [4]:
user_ratings.head()

   id userID  placeID  rating  food_rating  service_rating
0   1  U1077   135085       2            2               2
1   2  U1077   135038       2            2               1
2   3  U1077   132825       2            2               2
3   4  U1077   135060       1            2               2
4   5  U1068   135104       1            1               2

#### Check Cusine Dataframe information

In [5]:
cusine.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 916 entries, 0 to 915
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        916 non-null    int64
 1   placeID   916 non-null    int64
 2   Rcuisine  916 non-null    object
dtypes: int64(2), object(1)
memory usage: 21.6+ KB

#### Unique place IDs identifed

In [6]:
places: pd.DataFrame = pd.DataFrame({'placeID':[]})
places['placeID'] = cusine['placeID'].unique()
places.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 769 entries, 0 to 768
Data columns (total 1 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   placeID  769 non-null    int64
dtypes: int64(1)
memory usage: 6.1 KB

In [12]:
# places.head()

In [8]:
user_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1161 entries, 0 to 1160
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              1161 non-null   int64
 1   userID          1161 non-null   object
 2   placeID         1161 non-null   int64
 3   rating          1161 non-null   int64
 4   food_rating     1161 non-null   int64
 5   service_rating  1161 non-null   int64
dtypes: int64(5), object(1)
memory usage: 54.5+ KB

In [14]:
data: pd.DataFrame = pd.merge(user_ratings, places, on='placeID', how='inner');
# data.drop(['id_x','id_y'], axis=1, inplace=True)
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 873 entries, 0 to 872
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              873 non-null    int64
 1   userID          873 non-null    object
 2   placeID         873 non-null    int64
 3   rating          873 non-null    int64
 4   food_rating     873 non-null    int64
 5   service_rating  873 non-null    int64
dtypes: int64(5), object(1)
memory usage: 47.7+ KB

In [15]:
data.head()

    id userID  placeID  rating  food_rating  service_rating
0    1  U1077   135085       2            2               2
1   69  U1108   135085       1            2               1
2  212  U1081   135085       1            2               1
3  247  U1056   135085       2            2               2
4  258  U1134   135085       2            1               2

In [16]:
data['id'] = [id+1 for id in range(0, 873) ]
data.head()

   id userID  placeID  rating  food_rating  service_rating
0   1  U1077   135085       2            2               2
1   2  U1108   135085       1            2               1
2   3  U1081   135085       1            2               1
3   4  U1056   135085       2            2               2
4   5  U1134   135085       2            1               2

In [19]:
data.tail()

      id userID  placeID  rating  food_rating  service_rating  overall_rating
868  869  U1061   132958       2            2               2            2.00
869  870  U1025   132958       1            0               0            0.33
870  871  U1097   132958       2            1               1            1.33
871  872  U1096   132958       1            2               2            1.67
872  873  U1136   132958       2            2               2            2.00

In [17]:
data.to_csv(r'./processed/user_rating_data.csv', index=False);
# inner 1043 entries
# left 1331 entries
# right 1847 entries

In [18]:
data['overall_rating'] = data.apply(lambda row: round((row['rating'] + row['food_rating']+ row['service_rating'])/3,2), axis=1)
data.head()

   id userID  placeID  rating  food_rating  service_rating  overall_rating
0   1  U1077   135085       2            2               2            2.00
1   2  U1108   135085       1            2               1            1.33
2   3  U1081   135085       1            2               1            1.33
3   4  U1056   135085       2            2               2            2.00
4   5  U1134   135085       2            1               2            1.67